//#include <stdio.h>
//
//int main()
//{
//	//1:成立 0:不成立
//
//	// &&(且) :並且，而且，計算規則:只有兩邊都成立，那麼最終的結果才是成立的，只要有一個不成立，最終的結果都是不成立的
//	printf("%d\n", 1 && 1); //1
//	printf("%d\n", 1 && 0); //0
//	printf("%d\n", 0 && 1); //0
//	printf("%d\n", 0 && 0); //0
//	printf("------------------\n");
//
//	// ||(或)
//	printf("%d\n", 1 || 1); //1
//	printf("%d\n", 1 || 0); //1
//	printf("%d\n", 0 || 1); //1
//	printf("%d\n", 0 || 0); //0
//	printf("------------------\n");
//
//	//取反
//	printf("%d\n", !1); //0
//	printf("%d\n", !0); //1
//
//}
