//#include <stdio.h>
//
//int main()
//{
//	//除法(/)
//	printf("%d\n", 10 / 2);    // 5
//
//
//
//
//	//取餘(%)
//	printf("%d\n", 10 % 2);   //0
//	printf("%d\n", 10 % 3);   //1
//
//	//通用細節:
//	// 1. 整數計算，結果一定是一個整數
//	printf("%d\n", 3 + 2); //5
//	printf("%d\n", 10 / 3); //3
//
//	// 2.小數計算，結果一定是一個小數
//	printf("%lf\n", 10.0 + 3.0);
//
//	// 3.整數和小數計算，結果一定是一個小數
//	printf("%lf\n", 10 / 3.0);
//
//    // 4.小數直接參與計算，結果是有可能不精確的
//	printf("%lf\n", 3.3333333333333 + 6.66666666666666666);
//	printf("%.20lf\n", 10.0 / 3.0);
//
//	//除法的細節:
//	// 1.不能除以0
//	//printf("%d\n", 10 / 0);
//
//
//	//取餘的細節:
//	// 1.運算的數據必須全部都是整數
//	printf("%d\n", 10 % 3);
//	// 2.獲取餘數的正負，是跟第一個數字保持一致
//	printf("%d\n", 10 % 3); //1
//	printf("%d\n", -10 % 3); //-1
//	printf("%d\n", 10 % -3); //1
//	//3.不能除以0
//
//	return 0;
//}