//#include <stdio.h>
//
//int main()
//{
//	/*
//		需求:鍵盤輸入一個三位數，將其拆分為個位、十位、百位，打印在控制台
//		輸出結果:
//			個位是:3
//			十位是:2
//			百位是:1
//	123
//
//	123 除以 10  商是 12 餘數是 3
//	12  除以 10  商是 1  餘數是 2
//
//	*/
//
//	// 1. 鍵盤輸入一個三位數
//	printf("請輸入一個三位數:\n");
//	int num;
//	scanf("%d", &num);
//	//printf("%d\n", num);
//
//	// 2. 拆分
//	int ge = num % 10;
//	int shi = num / 10 % 10;
//	int bai = num / 10 / 10 % 10;
//
//
//	//3.輸出打印
//	printf("個位是: %d\n", ge);
//	printf("十位是:%d\n", shi);
//	printf("百位是:%d\n", bai);
//
//
//	return 0;
//}