//#include <stdio.h>
//
//int main()
//{
//	int a = 10;
//	int k1 = a++ + a++ + a; // 10 + 10 + 10 = 30 a=12
//	int k2 = ++a + ++a + a; // 14 + 14 + 14 = 42 a=14  
//	int k3 = ++a + a++ + a; // 15 + 15 + 15 = 45 a=16
//	int k4 = a++ + ++a + a; // 17 + 17 + 17 = 51 a=18 
//
//	printf("%d\n", k1);
//	printf("%d\n", k2);
//	printf("%d\n", k3);
//	printf("%d\n", k4);
//
//
//	//mac 和linux作業系統
//	// 10 + 11 + 12 = 33 a = 12
//	// 13 + 14 + 14 = 41 a = 14
//	// 15 + 15 + 16 = 46 a = 16
//	// 16 + 18 + 18 = 52 a = 18
//	return 0;
//}