//#include <stdio.h>
//
//int main()
//{
//	//1.定義格式: 數據類型 變量名;
//	int a;
//	//2.賦值/修改; 變量名 = 數據值;
//	a = 10;
//
//	printf("%d\n", a);
//
//	//3.如果定義的時候，已經知道變量中存儲的數據
//	int b = 20;
//	printf("%d\n", b);
//
//	//練習1:兩個數相加(變量與計算)
//	//需求:定義兩個變量分別存儲10和20，求兩個數的和
//	int c = 10;
//	int d = 20;
//	printf("%d\n", c + d);
//	int e = c + d;
//	printf("%d\n", e);
//
//	//練習2:用一個變量表示微信的餘額
//	//需求: 一開始微信的金額為100元，收到了一個2元的紅包
//	//經常發生改的數據，我們可以用變量來表示
//
//	int money = 100;
//	money = money + 2;
//	printf("%d\n", money);
//}